-- --------------------------------------------------------
-- Host:                         117.34.66.7
-- Server version:               5.5.24-log - Source distribution
-- Server OS:                    Linux
-- HeidiSQL version:             7.0.0.4176
-- Date/time:                    2013-07-06 17:59:08
-- --------------------------------------------------------

INSERT INTO `airports` (`id`, `name`, `city_id`, `status`) VALUES
	(1, '白云国际机场', '4401', 'Y'),
	(2, '郑州新郑机场', '4101', 'Y'),
	(3, '长沙黄花机场 ', '4301', 'Y'),
	(4, '成都双流国际机场', '5101', 'Y'),
	(5, '大连周水子国际机场', '2102', 'Y'),
	(6, '海口美兰国际机场', '4601', 'Y'),
	(7, '呼和浩特据白塔机场', '1501', 'Y'),
	(8, '杭州萧山国际机场', '3301', 'Y'),
	(9, '哈尔滨太平国际机场', '2301', 'Y'),
	(10, '南昌昌北国际机场 ', '3601', 'Y'),
	(11, '昆明巫家坝国际机场', '5301', 'Y'),
	(12, '桂林两江机场', '4503', 'Y'),
	(13, '北京南苑机场', '1100', 'Y'),
	(14, '南京禄口国际机场', '3201', 'Y'),
	(15, '南宁吴圩机场', '4501', 'Y'),
	(16, '南通兴东机场 ', '3206', 'Y'),
	(17, '北京首都国际机场', '1100', 'Y'),
	(18, '沈阳桃仙国际机场', '2101', 'Y'),
	(19, '石家庄正定机场 ', '1301', 'Y'),
	(20, '深圳宝安国际机场', '4403', 'Y'),
	(21, '太远武宿机场', '1401', 'Y'),
	(22, '乌鲁木齐地窝堡国际机场', '6501', 'Y'),
	(23, '武汉天河机场', '4201', 'Y'),
	(24, '无锡机场', '3202', 'Y'),
	(25, '西安咸阳国际机场', '6101', 'Y'),
	(26, '天津滨海国际机场', '1200', 'Y'),
	(27, '珠海机场', '4404', 'Y');
