app/controllers/cars_controller.rb

SELECT COUNT(*) FROM `cars`
SELECT `cars`.* FROM `cars` LIMIT 10 OFFSET 0
---
  def index
    if current_user.role=='oprator'
      @where = current_user.company.locations.pluck(:id)
      @search = Car.search(params[:search]).where("location_id in (?)",@where)
    else
      @search = Car.search(params[:search])
    end
    @cars = @search.page params[:page]