app/controllers/cities_controller.rb

SELECT COUNT(*) FROM `cities`
SELECT `cities`.* FROM `cities` LIMIT 10 OFFSET 0
---
  def index
    @search = City.search(params[:search])
    @cities=@search.page params[:page]