app/controllers/companies_controller.rb

  def index
    if current_user.role=='oprator'
      @where = "#{current_user.company_id}"
      @search = Company.where(:id=>@where).search(params[:search])
    else
      @search = Company.search(params[:search])
    end
    @companies=@search.page params[:page]
---
SELECT `companies`.* FROM `companies` LIMIT 10 OFFSET 0