app/controllers/districts_controller.rb

SELECT COUNT(*) FROM `districts`
SELECT `districts`.* FROM `districts` LIMIT 10 OFFSET 0
---
  def index
    @search = District.search(params[:search])
    @districts=@search.page params[:page]