app/controllers/drivers_controller.rb

  def index
    @search = Driver.search(params[:search])
    if current_user.role=='oprator'
      @where = "#{current_user.company_id}"
      @drivers=@search.where(:company_id=>@where).page params[:page]
    else
      @drivers=@search.page params[:page]
---
SELECT `drivers`.* FROM `drivers` LIMIT 10 OFFSET 0