app/controllers/user_sessions_controller.rb

SELECT `manager_users`.* FROM `manager_users` WHERE `manager_users`.`login_name` = 'admin' LIMIT 1
---
  def create
    user = ManagerUser.find_by_login_name(params[:login])